Revit 2024 API
StructuralReleaseType Enumeration
 Type of structural release, which is used for the BuiltIn parameter STRUCTURAL_END_RELEASE_TYPE.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public enum StructuralReleaseType
Visual Basic
Public Enumeration StructuralReleaseType
Visual C++
public enum class StructuralReleaseType
Members
Member name | Description
kFixed
kPinned
kBendingMoment
kUserDefined
See Also
Autodesk.Revit.DB Namespace